Revit 2023 API
PolylineNode Class
 An output node that represents a 3D polyline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2016
Syntax
C#
public class PolylineNode : ModelCurveNode
Visual Basic
Public Class PolylineNode _
	Inherits ModelCurveNode
Visual C++
public ref class PolylineNode : public ModelCurveNode
Remarks
 See also: OnPolyline(PolylineNode).
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RenderNode
 Autodesk.Revit.DB.ModelCurveNode
 Autodesk.Revit.DB.PolylineNode
See Also
PolylineNode Members
Autodesk.Revit.DB Namespace